Enums/УчетНачисленийВСреднемЗаработкеОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеОбщий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийЗаработок</Name>
					<Comment>Общий заработок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияФиксированнойСуммой</Name>
					<Comment>Премия, учитываемая пропорционально отработанному времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПроцентом</Name>
					<Comment>Премия, полностью учитываемая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяФиксированнойСуммой</Name>
					<Comment>Годовая премия, учитываемая пропорционально отработанному времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяПроцентом</Name>
					<Comment>Годовая премия, полностью учитываемая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
					<Comment>Не включать</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УчетНачисленийВСреднемЗаработкеОбщий/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТолькоПремия = Ложь;
	
	СтандартнаяОбработка = Ложь;
	Если Параметры.Свойство("ТолькоПремия") Тогда
		ТолькоПремия = Параметры.ТолькоПремия;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	// Добавляем общий заработок, если нет отбора.
	Если Не ТолькоПремия Тогда
		ДанныеВыбора.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок);
	КонецЕсли;
	// Заполняем премиями в любом случае.
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВыбора, Премии());
	
	Если Не ТолькоПремия Тогда
		ДанныеВыбора.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать);
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Премии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой"));
	
	Возврат Премии;
	
КонецФункции

Функция ГодовыеПремии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой"));
	
	Возврат Премии;
	
КонецФункции

Функция ПремииПроцентом() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	
	Возврат Премии;
	
КонецФункции

#КонецОбласти
